src/cf/DataProcessors/LicensingManagement.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>LicensingManagement</Name>
			<Comment>Управление лицензированием</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ErrorDescription</Name>
					<Comment>Описание ошибки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ErrorCode</Name>
					<Comment>Код ошибки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StartMode</Name>
					<Comment>Режим старта</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ServerAddress</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LicenseNumber</Name>
					<Comment>Регистрационный номер</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Pin</Name>
					<Comment>Пин-код</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>23</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EquipmentSignature</Name>
					<Comment>Сигнатура оборудования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EquipmentDescription</Name>
					<Comment>Описание оборудования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ActivationVariant</Name>
					<Comment>Вариант активации</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Responsible</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Phone</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Email</Name>
					<Comment>Электронная почта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Site</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InternetActivationResponse</Name>
					<Comment>Ответ интернет активации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RequestResponse</Name>
					<Comment>Переключатель запрос или ответ активации</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PhoneActivationRequestBlock</Name>
					<Comment>Строка запроса телефонной активации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>58</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PhoneActivationResponseBlock1</Name>
					<Comment>Блок ответа телефонной активации 1</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>27</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PhoneActivationResponseBlock2</Name>
					<Comment>Блок ответа телефонной активации 2</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>27</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PhoneActivationResponseBlock3</Name>
					<Comment>Блок ответа телефонной активации 3</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>27</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ConnetToSelectedServerAfterActivation</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LicensePackageRegistrationNumber</Name>
					<Comment>Регистрационный номер пакета лицензий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PackageLicensePassword</Name>
					<Comment>Пароль пакета лицензий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ActivationMethod</Name>
					<Comment>Способ активации</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>KeyNumber</Name>
					<Comment>Номер ключа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FactoryKeyNumber</Name>
					<Comment>Заводской номер ключа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Installer</Name>
					<Comment>Установщик</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ProtectionKeyAccessCode</Name>
					<Comment>Код доступа ключа защиты</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DataProcessorName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/DataProcessors/LicensingManagement/Forms/LicensingParametersInfo/Ext/Form/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	ServerAddress = SessionParameters.LicensingServerAddress;
	
	If NOT ValueIsFilled(ServerAddress) Then
		MessageString = (NStr("ru = 'Отсутствует подключение к серверу лицензирования'; en = 'No connection to the license server'"));
		Message = New UserMessage();
		Message.Text = MessageString;
		Message.Message();
		LicensingServer.WriteErrorInEventLog(MessageString);
		Cancel = True;
	EndIf;
	
	SolutionsList = LicensingSupport.GetProductList();
	
	If SolutionsList.Count() > 1 Then // Несколько решений
		Items.SelectedSolution.Visible = True;
		SolutionCount = SolutionsList.Count();
		SelectedSolutionList = Items.SelectedSolution.ChoiceList;
		SolutionIndex = 0;
		For Each ListItem In SolutionsList Do
			SelectedSolutionList.Add(SolutionIndex, ListItem.Value);
			SolutionIndex = SolutionIndex + 1;
		EndDo;
	Else
		Items.SelectedSolution.Visible = False;
	EndIf;
	
	SelectedSolution = 0;
	
	DataProcessorName = GetDataProcessorNameByIndex(SelectedSolution);
	
	If NOT Cancel Then
		Result = GetKeyParameters(DataProcessorName);
		
		DistrWithSoftwareKey = (SerialNumber = HardwareNumber);
		
		If Result Then
			FillParametersTable();
		Else
			Items.ErrorDescription.Visible = True;
			ErrorDescription = NStr("ru = 'Не удалось получить параметры ключа защиты'");
		EndIf;
	EndIf;
EndProcedure

&AtServer
Function GetKeyParameters(DataProcessorName)
	ParameterEndDate = 0;
	
	Result = LicensingServer.GetProtectionKeyParameters(DataProcessorName, TotalUsersForPlace, FreeUsersForPlace, TotalUsersForSession
	                                                             , FreeUsersForSession, Mask, Counter1, Counter2, Counter3
																 , ParameterEndDate, KeyType, SerialNumber, HardwareNumber, Pin, KeyName, ErrorDescription, ErrorCode);
	If NOT Result Then
		Return False;
	Else
		EndDate = ParameterEndDate;
		Return True;
	EndIf;
EndFunction

&AtServer
Function GetDataProcessorNameByIndex(IndexOf)
	SolutionsList = LicensingSupport.GetProductList();
	CurrIndex = 0;
	For Each ListItem In SolutionsList Do
		If CurrIndex = IndexOf Then
			Return ListItem.Key;
		Else
			CurrIndex = CurrIndex + 1;
		EndIf;
	EndDo;
EndFunction

// Возвращает строковое представление типа ключа
&AtServer
Function StringKeyType(KeyType)
	If DistrWithSoftwareKey Then
		KeyTypeAsString = NStr("ru = 'Программный'; en = 'Software'");
	Else
		KeyTypeAsString = NStr("ru = 'Аппаратный'; en = 'Hardware'");
	EndIf;
	
	If KeyType = 2 Then
		KeyTypeAsString = KeyTypeAsString + NStr("ru = ', Демонстрационный'; en = ', demo'");
	EndIf;
	
	Return KeyTypeAsString;
EndFunction

// Возвращает описание количества подключений
&AtServer
Function StringConnectionNumber(Всего, Свободно)
	If Всего>=255 Then
		String = NStr("ru = 'Без ограничений '; en = 'Without restriction '") + Chars.NBSp + NStr("ru = 'занято -'; en = 'used -'") + Chars.NBSp + String(Всего - Свободно);
	Else
		String = NStr("ru = 'всего - '; en = 'total -'") + String(Всего) + ", " + NStr("ru = 'занято - '; en = 'used -'") + String(Всего - Свободно) + ", " + NStr("ru = 'свободно - '; en = 'available -'") + String(Свободно);
	EndIf;
	Return String;
EndFunction

// Возвращает строковое представление даты окончания действия ключа
&AtServer
Function StringExpirationDate(EndDate)
	If EndDate = '18991230000000' Then
		ExpirationDateAsString = NStr("ru = 'Не определено'; en = 'not determined'");
	Else
		ExpirationDateAsString = Format(EndDate,"DLF=D");
	EndIf;
	Return ExpirationDateAsString;
EndFunction

// Заполняет таблицу параметров ключа лицензирования
&AtServer
Procedure FillParametersTable()
	ParametersTableAddRow(NStr("ru = 'Сервер лицензирования'; en = 'License server'"), SessionParameters.LicensingServerAddress);
	ParametersTableAddRow(NStr("ru = 'Наименование ключа'; en = 'The key name'"), KeyName);
	ParametersTableAddRow(NStr("ru = 'Серийный номер'; en = 'Serial number'"), SerialNumber);
	If NOT DistrWithSoftwareKey Then
		ParametersTableAddRow(NStr("ru = 'Аппаратный номер'; en = 'Hardware key number'"), HardwareNumber);
	EndIf;
	ParametersTableAddRow(NStr("ru = 'Дата окончания'; en = 'Expiration date'"), StringExpirationDate(EndDate));
	ParametersTableAddRow(NStr("ru = 'Тип ключа'; en = 'Key type'"), StringKeyType(KeyType));
	If DistrWithSoftwareKey Then
		ParametersTableAddRow(NStr("ru = 'Пин-код'; en = 'PIN'"), Pin);
	EndIf;
	ParametersTableAddRow(NStr("ru = 'Подключений за место'; en = 'Connections for a place'"), StringConnectionNumber(TotalUsersForPlace, FreeUsersForPlace));
	ParametersTableAddRow(NStr("ru = 'Подключений за сессию'; en = 'Connections per session'"), StringConnectionNumber(TotalUsersForSession, FreeUsersForSession));
	ParametersTableAddRow(NStr("ru = 'Маска'; en = 'Mask'"), Mask);
	ParametersTableAddRow(NStr("ru = 'Маска 2'; en = 'Mask 2'"), Counter2);
	ParametersTableAddRow(NStr("ru = 'Версия компоненты'; en = 'Version of the protection component'"), LicensingServer.GetProtectedDataProcessor(DataProcessorName).Компонента.Версия);
	
	ComponentStoragePlace = LicensingServer.GetComponentStoragePlace();
	If Find(ComponentStoragePlace, "CommonTemplate") Then
		ComponentSource = NStr("ru = 'Внутреннее хранилище'; en = 'Internal storage'");
	Else
		ComponentSource = NStr("ru = 'Внешнее хранилище'; en = 'External storage'");
	EndIf;
	ParametersTableAddRow(NStr("ru = 'Источник компоненты'; en = 'Location of component'"), ComponentSource);
EndProcedure

&AtServer
Procedure ParametersTableAddRow(Parameter, Value)
	NewLine = KeyParametersTable.Add();
	NewLine.Parameter = Parameter;
	NewLine.Value = Value;
EndProcedure

&AtClient
Procedure CommandSaveToFile(Command)
	Text = "";
	
	Text = Text + NStr("ru = 'DATE:'") + Chars.NBSp + CurrentDate() + Chars.CR + Chars.LF;
	If NOT ErrorDescription = "" Then
		Text = Text + NStr("ru = 'Описание ошибки: '; en = 'Error description'") + ErrorDescription + Chars.CR + Chars.LF; 
	EndIf;
	
	For Each CurRow In KeyParametersTable Do
		Text = Text + CurRow.Parameter + ": " + CurRow.Value + Chars.CR + Chars.LF;
	EndDo;
	
	FileName = "LicParam_"+SerialNumber+".txt";
	
	Dialog = New FileDialog(FileDialogMode.Save);
	
	Dialog.Title = NStr("ru = 'Сохранить файл параметров лицензирования как'; en = 'Save the licensing options file as'");
	Dialog.Filter = NStr("ru = 'Files *.txt|*.txt'; en = 'Files *.txt|*.txt'");
	Dialog.FullFileName = FileName;
	
	Dialog.Show(New NotifyDescription("CommandSaveToFileEnd", ThisObject, New Structure("Dialog, Text", Dialog, Text)));
EndProcedure

&AtClient
Procedure CommandSaveToFileEnd(SelectedFiles, AdditionalParameters) Export
	
	Dialog = AdditionalParameters.Dialog;
	Text = AdditionalParameters.Text;
	
	
	If (SelectedFiles <> Undefined) Then
		FileName = Dialog.FullFileName;
	Else
		Return;
	EndIf;
	
	File = New TextDocument();
	File.Write(FileName, TextEncoding.ANSI);
	
	File.SetText(Text);
	File.Write(FileName, TextEncoding.ANSI);
	
	WarningText = NStr("ru = 'Описание текущих параметров лицензирования сохранено в файл: '; en = 'Description of the current licensing options stored in the file'") + FileName;
	ShowMessageBox(Undefined, WarningText,,NStr("ru = 'Сохранен файл текущих параметров лицензирования'; en = 'The file is saved'"));

EndProcedure

&AtClient
Procedure SelectedSolutionOnChange(Item)
	
	KeyParametersTable.Clear();
	
	Result = GetKeyParameters(GetDataProcessorNameByIndex(SelectedSolution));
	
	DistrWithSoftwareKey = (SerialNumber = HardwareNumber);
	
	If Result Then
		FillParametersTable();
	Else
		Items.ErrorDescription.Visible = True;
		ErrorDescription = NStr("ru = 'Не удалось получить параметры ключа защиты'; en = 'Could not get the key parameters of protection'");
	EndIf;
EndProcedure

&AtClient
Procedure CloseForm(Command)
	Close();
EndProcedure
